#!/usr/bin/env python
# -*- encoding: utf8

"""
Да се напише фунцкия, която връща всички възможни начини,
по които може да се развали банкнота от 10 лева на 
банкноти/монети от 1, 2 и 5 лв.

Използва се следното представяне:
(a, b, c) -> a*1 + b*2 + c*5 == 10

"""

def solve(value):
	# TODO: implement
	return set()

def main():
	result = solve(10)
	print(result == set([
			(0, 0, 2),
			(0, 5, 0),
			(1, 2, 1),
			(2, 4, 0),
			(3, 1, 1),
			(4, 3, 0),
			(5, 0, 1),
			(6, 2, 0),
			(8, 1, 0),
			(10, 0, 0),
		])
	)


if __name__ == "__main__":
	main()
